wrk_rps_merged/84
Running 5m test @ http://10.103.214.99:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 351.051ms, rate sampling interval: 1363ms
  Thread calibration: mean lat.: 360.354ms, rate sampling interval: 1392ms
  Thread calibration: mean lat.: 399.432ms, rate sampling interval: 1534ms
  Thread calibration: mean lat.: 393.061ms, rate sampling interval: 1404ms
  Thread calibration: mean lat.: 413.421ms, rate sampling interval: 1543ms
  Thread calibration: mean lat.: 411.482ms, rate sampling interval: 1561ms
  Thread calibration: mean lat.: 427.498ms, rate sampling interval: 1542ms
  Thread calibration: mean lat.: 425.433ms, rate sampling interval: 1540ms
  Thread calibration: mean lat.: 426.670ms, rate sampling interval: 1542ms
  Thread calibration: mean lat.: 436.946ms, rate sampling interval: 1551ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   435.60ms  303.35ms   2.50s    80.21%
    Req/Sec     9.51      2.97    21.00     82.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  386.82ms
 75.000%  557.05ms
 90.000%  694.78ms
 99.000%    1.69s 
 99.900%    2.36s 
 99.990%    2.45s 
 99.999%    2.50s 
100.000%    2.50s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.485     0.000000            1         1.00
     105.471     0.100000         2905         1.11
     206.591     0.200000         5810         1.25
     288.511     0.300000         8708         1.43
     360.703     0.400000        11626         1.67
     386.815     0.500000        14516         2.00
     446.207     0.550000        15958         2.22
     459.263     0.600000        17415         2.50
     472.319     0.650000        18874         2.86
     489.215     0.700000        20311         3.33
     557.055     0.750000        21762         4.00
     567.295     0.775000        22509         4.44
     577.535     0.800000        23241         5.00
     590.847     0.825000        23934         5.71
     655.359     0.850000        24669         6.67
     672.767     0.875000        25389         8.00
     681.983     0.887500        25766         8.89
     694.783     0.900000        26114        10.00
     754.175     0.912500        26477        11.43
     772.607     0.925000        26839        13.33
     801.791     0.937500        27199        16.00
     868.351     0.943750        27382        17.78
     893.951     0.950000        27563        20.00
     979.455     0.956250        27744        22.86
    1145.855     0.962500        27924        26.67
    1257.471     0.968750        28105        32.00
    1278.975     0.971875        28198        35.56
    1354.751     0.975000        28289        40.00
    1378.303     0.978125        28378        45.71
    1456.127     0.981250        28468        53.33
    1500.159     0.984375        28558        64.00
    1554.431     0.985938        28604        71.11
    1581.055     0.987500        28649        80.00
    1658.879     0.989062        28693        91.43
    1751.039     0.990625        28740       106.67
    1796.095     0.992188        28785       128.00
    1855.487     0.992969        28808       142.22
    1890.303     0.993750        28829       160.00
    1961.983     0.994531        28852       182.86
    1989.631     0.995313        28875       213.33
    2055.167     0.996094        28898       256.00
    2063.359     0.996484        28909       284.44
    2072.575     0.996875        28920       320.00
    2095.103     0.997266        28932       365.71
    2156.543     0.997656        28944       426.67
    2177.023     0.998047        28954       512.00
    2201.599     0.998242        28960       568.89
    2254.847     0.998437        28965       640.00
    2277.375     0.998633        28971       731.43
    2349.055     0.998828        28977       853.33
    2355.199     0.999023        28982      1024.00
    2357.247     0.999121        28985      1137.78
    2365.439     0.999219        28988      1280.00
    2367.487     0.999316        28991      1462.86
    2369.535     0.999414        28994      1706.67
    2371.583     0.999512        28996      2048.00
    2373.631     0.999561        28998      2275.56
    2375.679     0.999609        28999      2560.00
    2377.727     0.999658        29001      2925.71
    2379.775     0.999707        29002      3413.33
    2381.823     0.999756        29004      4096.00
    2381.823     0.999780        29004      4551.11
    2451.455     0.999805        29006      5120.00
    2451.455     0.999829        29006      5851.43
    2451.455     0.999854        29006      6826.67
    2453.503     0.999878        29007      8192.00
    2453.503     0.999890        29007      9102.22
    2490.367     0.999902        29008     10240.00
    2490.367     0.999915        29008     11702.86
    2490.367     0.999927        29008     13653.33
    2498.559     0.999939        29010     16384.00
    2498.559     1.000000        29010          inf
#[Mean    =      435.600, StdDeviation   =      303.349]
#[Max     =     2496.512, Total count    =        29010]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30040 requests in 5.00m, 169.01MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:    100.10
Transfer/sec:    576.71KB