wrk_rps_merged/886
Running 5m test @ http://10.97.24.210:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 681.414ms, rate sampling interval: 2277ms
  Thread calibration: mean lat.: 645.386ms, rate sampling interval: 2067ms
  Thread calibration: mean lat.: 688.420ms, rate sampling interval: 2258ms
  Thread calibration: mean lat.: 681.674ms, rate sampling interval: 2236ms
  Thread calibration: mean lat.: 687.673ms, rate sampling interval: 2416ms
  Thread calibration: mean lat.: 670.595ms, rate sampling interval: 2238ms
  Thread calibration: mean lat.: 699.253ms, rate sampling interval: 2414ms
  Thread calibration: mean lat.: 680.086ms, rate sampling interval: 2260ms
  Thread calibration: mean lat.: 691.641ms, rate sampling interval: 2240ms
  Thread calibration: mean lat.: 679.889ms, rate sampling interval: 2234ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   520.43ms  309.90ms   2.84s    78.49%
    Req/Sec     9.50      1.29    13.00     89.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  512.51ms
 75.000%  647.17ms
 90.000%  830.97ms
 99.000%    1.72s 
 99.900%    2.22s 
 99.990%    2.64s 
 99.999%    2.84s 
100.000%    2.84s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.693     0.000000            1         1.00
     155.391     0.100000         2904         1.11
     312.319     0.200000         5809         1.25
     354.047     0.300000         8709         1.43
     432.639     0.400000        11606         1.67
     512.511     0.500000        14524         2.00
     526.847     0.550000        15990         2.22
     541.695     0.600000        17421         2.50
     609.791     0.650000        18904         2.86
     626.175     0.700000        20316         3.33
     647.167     0.750000        21771         4.00
     709.631     0.775000        22485         4.44
     719.871     0.800000        23227         5.00
     733.695     0.825000        23944         5.71
     746.495     0.850000        24659         6.67
     811.519     0.875000        25408         8.00
     821.759     0.887500        25761         8.89
     830.975     0.900000        26116        10.00
     840.703     0.912500        26479        11.43
     852.991     0.925000        26846        13.33
     919.039     0.937500        27204        16.00
     929.279     0.943750        27380        17.78
     939.007     0.950000        27569        20.00
     949.759     0.956250        27740        22.86
    1039.871     0.962500        27921        26.67
    1250.303     0.968750        28103        32.00
    1335.295     0.971875        28194        35.56
    1414.143     0.975000        28284        40.00
    1506.303     0.978125        28374        45.71
    1546.239     0.981250        28466        53.33
    1622.015     0.984375        28557        64.00
    1633.279     0.985938        28602        71.11
    1641.471     0.987500        28646        80.00
    1708.031     0.989062        28691        91.43
    1729.535     0.990625        28740       106.67
    1753.087     0.992188        28784       128.00
    1809.407     0.992969        28805       142.22
    1818.623     0.993750        28829       160.00
    1827.839     0.994531        28852       182.86
    1835.007     0.995313        28874       213.33
    1846.271     0.996094        28895       256.00
    1854.463     0.996484        28907       284.44
    1905.663     0.996875        28918       320.00
    1924.095     0.997266        28930       365.71
    1943.551     0.997656        28944       426.67
    1951.743     0.998047        28952       512.00
    1957.887     0.998242        28959       568.89
    2026.495     0.998437        28963       640.00
    2119.679     0.998633        28970       731.43
    2136.063     0.998828        28975       853.33
    2312.191     0.999023        28980      1024.00
    2338.815     0.999121        28983      1137.78
    2412.543     0.999219        28986      1280.00
    2437.119     0.999316        28990      1462.86
    2447.359     0.999414        28992      1706.67
    2533.375     0.999512        28994      2048.00
    2535.423     0.999561        28997      2275.56
    2535.423     0.999609        28997      2560.00
    2541.567     0.999658        29000      2925.71
    2541.567     0.999707        29000      3413.33
    2631.679     0.999756        29001      4096.00
    2635.775     0.999780        29003      4551.11
    2635.775     0.999805        29003      5120.00
    2637.823     0.999829        29004      5851.43
    2637.823     0.999854        29004      6826.67
    2641.919     0.999878        29005      8192.00
    2641.919     0.999890        29005      9102.22
    2643.967     0.999902        29006     10240.00
    2643.967     0.999915        29006     11702.86
    2643.967     0.999927        29006     13653.33
    2832.383     0.999939        29007     16384.00
    2832.383     0.999945        29007     18204.44
    2832.383     0.999951        29007     20480.00
    2832.383     0.999957        29007     23405.71
    2832.383     0.999963        29007     27306.67
    2838.527     0.999969        29008     32768.00
    2838.527     1.000000        29008          inf
#[Mean    =      520.433, StdDeviation   =      309.896]
#[Max     =     2836.480, Total count    =        29008]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30023 requests in 5.00m, 176.83MB read
Requests/sec:    100.05
Transfer/sec:    603.46KB